<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"86fa0be384e7daa55bf9627fdea8e1d822722b6fe02a93de209fb45ae6bd429e","plan_job_ref":"Job Terraform Plan #213 at https://github.com/cal-itp/data-infra/actions/runs/15451172871","plan_out_hash":"e4627216ccf2ada4c039ba5fbc889ed6350e00d3e580bf68d30620929e4e601d","plan_hash":"7e591e1e1d18065b2c849d085e3b7ee3585d8715012d1f8f15667e525cf87ae7","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/firewall/us__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_compute_firewall.tfer--gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-all will be created
+   resource "google_compute_firewall" "tfer--gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-all" {
+       creation_timestamp = (known after apply)
+       destination_ranges = (known after apply)
+       direction          = "INGRESS"
+       disabled           = false
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-all"
+       network            = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/networks/default"
+       priority           = 1000
+       project            = "cal-itp-data-infra"
+       self_link          = (known after apply)
+       source_ranges      = [
+           "10.15.0.0/17",
        ]
+       target_tags        = [
+           "gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-node",
        ]

+       allow {
+           ports    = []
+           protocol = "ah"
        }
+       allow {
+           ports    = []
+           protocol = "esp"
        }
+       allow {
+           ports    = []
+           protocol = "icmp"
        }
+       allow {
+           ports    = []
+           protocol = "sctp"
        }
+       allow {
+           ports    = []
+           protocol = "tcp"
        }
+       allow {
+           ports    = []
+           protocol = "udp"
        }
    }

  # google_compute_firewall.tfer--gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-exkubelet will be created
+   resource "google_compute_firewall" "tfer--gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-exkubelet" {
+       creation_timestamp = (known after apply)
+       destination_ranges = (known after apply)
+       direction          = "INGRESS"
+       disabled           = false
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-exkubelet"
+       network            = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/networks/default"
+       priority           = 1000
+       project            = "cal-itp-data-infra"
+       self_link          = (known after apply)
+       source_ranges      = [
+           "0.0.0.0/0",
        ]
+       target_tags        = [
+           "gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-node",
        ]

+       deny {
+           ports    = [
+               "10255",
            ]
+           protocol = "tcp"
        }
    }

  # google_compute_firewall.tfer--gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-inkubelet will be created
+   resource "google_compute_firewall" "tfer--gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-inkubelet" {
+       creation_timestamp = (known after apply)
+       destination_ranges = (known after apply)
+       direction          = "INGRESS"
+       disabled           = false
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-inkubelet"
+       network            = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/networks/default"
+       priority           = 999
+       project            = "cal-itp-data-infra"
+       self_link          = (known after apply)
+       source_ranges      = [
+           "10.15.0.0/17",
        ]
+       source_tags        = [
+           "gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-node",
        ]
+       target_tags        = [
+           "gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-node",
        ]

+       allow {
+           ports    = [
+               "10255",
            ]
+           protocol = "tcp"
        }
    }

  # google_compute_firewall.tfer--gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-vms will be created
+   resource "google_compute_firewall" "tfer--gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-vms" {
+       creation_timestamp = (known after apply)
+       destination_ranges = (known after apply)
+       direction          = "INGRESS"
+       disabled           = false
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-vms"
+       network            = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/networks/default"
+       priority           = 1000
+       project            = "cal-itp-data-infra"
+       self_link          = (known after apply)
+       source_ranges      = [
+           "10.128.0.0/9",
        ]
+       target_tags        = [
+           "gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-node",
        ]

+       allow {
+           ports    = [
+               "1-65535",
            ]
+           protocol = "tcp"
        }
+       allow {
+           ports    = [
+               "1-65535",
            ]
+           protocol = "udp"
        }
+       allow {
+           ports    = []
+           protocol = "icmp"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!~  google_compute_firewall_tfer--gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-all_self_link       = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/firewalls/gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-all" -> (known after apply)
!~  google_compute_firewall_tfer--gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-exkubelet_self_link = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/firewalls/gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-exkubelet" -> (known after apply)
!~  google_compute_firewall_tfer--gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-inkubelet_self_link = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/firewalls/gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-inkubelet" -> (known after apply)
!~  google_compute_firewall_tfer--gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-vms_self_link       = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/firewalls/gke-us-west2-calitp-airflow2-pr-88ca8ec6-gke-98ed8a64-vms" -> (known after apply)
```
</details>

:memo: Plan generated in [Terraform Plan #213](https://github.com/cal-itp/data-infra/actions/runs/15451172871)